# 1 Создайте пустой словарь
# 2 Трижды попросите пользователя сначало ввести название ключа, следом значение ключа.
# Во время получения данных от пользователя добавляйте в словарь ключ значение
# Вывести в терминал результат


auto = {}

auto['brand'] = input('Введите марку авто: ')
auto['year'] = input('Введите год авто: ')
auto['price'] = input('Введите цену авто: ')

print(auto)

# запуск терминал python3 zadacha_dict.py
